In [1]:
import sys
print(sys.version)

3.8.16 (default, Jan 17 2023, 22:25:28) [MSC v.1916 64 bit (AMD64)]

In [2]:
conda install snowflake-snowpark-python

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

Retrieving notices: ...working... done

Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 22.9.0
  latest version: 23.1.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [3]:
import numpy as np

In [4]:
conda install pandas

Collecting package metadata (current_repodata.json): ...working... done
Solving environment: ...working... done

# All requested packages already installed.

Retrieving notices: ...working... done

Note: you may need to restart the kernel to use updated packages.

==> WARNING: A newer version of conda exists. <==
  current version: 22.9.0
  latest version: 23.1.0

Please update conda by running

    $ conda update -n base -c defaults conda

In [5]:
import pandas as pd

In [6]:
from snowflake.snowpark import Session

In [7]:
connection_parameters = {
...    "account": "xercwzx-yr09453",
...    "user": "PRASAD",
...    "password": "Munna26i@",
...    "role": "ACCOUNTADMIN",  # optional
...    "warehouse": "COMPUTE_WH",  # optional
...    "database": "PRASAD",  # optional
...    "schema": "SCHEMA",  # optional
...  }

In [8]:
new_session = Session.builder.configs(connection_parameters).create()

In [9]:
import snowflake.connector

In [10]:
conn = snowflake.connector.connect(
    user='PRASAD',
    password='Munna26i@',
    account='xercwzx-yr09453',
    warehouse='COMPUTE_WH',
    database='PRASAD',
    schema='SCHEMA'
)

In [11]:
query = 'SELECT * FROM "PRASAD"."SCHEMA"."EMPLOYEES";'
df = pd.read_sql(query, conn)

C:\Users\Venky\anaconda3\envs\python38\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [12]:
df.head()

,EMPNO,ENAME,JOB,MGR,HIREDATE,SALARY,COMM,DEPTNO
0,7773,PRASAD,DATA ENGG,2000.0,2016-11-04,2800.0,100.0,2501
1,7723,VIJAY,DATA ENGG,2000.0,2017-11-05,2000.0,70.0,2501
2,7001,RAJEEVI,ANALYST,2000.0,2016-11-06,2000.0,100.0,2501
3,2000,BALU,PRINCIPAL DATA ENGG,4000.0,2016-11-07,4000.0,200.0,2501
4,4000,RAJEEV,MANAGER,1000.0,2016-11-08,5000.0,76.0,2500

In [15]:
conda install openpyxl #download this module to save dataframes to excel

Note: you may need to restart the kernel to use updated packages.

CondaValueError: invalid package specification: #download

In [18]:
df

,EMPNO,ENAME,JOB,MGR,HIREDATE,SALARY,COMM,DEPTNO
0,7773,PRASAD,DATA ENGG,2000.0,2016-11-04,2800.0,100.0,2501
1,7723,VIJAY,DATA ENGG,2000.0,2017-11-05,2000.0,70.0,2501
2,7001,RAJEEVI,ANALYST,2000.0,2016-11-06,2000.0,100.0,2501
3,2000,BALU,PRINCIPAL DATA ENGG,4000.0,2016-11-07,4000.0,200.0,2501
4,4000,RAJEEV,MANAGER,1000.0,2016-11-08,5000.0,76.0,2500
5,1000,VIJAY KOTU,SR MANAGER,200.0,2016-11-09,6000.0,200.0,2500
6,7012,PADMA,DEVELOPER,3000.0,2016-11-10,2600.0,50.0,2502
7,8012,HASIN,DEVELOPER,3000.0,2016-11-11,2000.0,80.0,2502
8,5345,GIRISH,DEVELOPER,3000.0,2016-11-12,2000.0,56.0,2502
9,3000,VIVEK,MANAGER,4000.0,2016-11-13,3000.0,200.0,2502
10,6508,ARCHIT,DEVELOPER,3000.0,2016-11-14,2300.0,80.0,2502
11,7023,JOANE,ANALYST,2000.0,2016-11-15,2100.0,68.0,2501
12,8012,SURI,DESIGNER,4000.0,2016-11-16,2100.0,80.0,2502
13,200,CHRIS,CFO,NaN,None,8000.0,1000.0,2500